nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
//
// Copyright (c) 2017 The nanoFramework project contributors
// See LICENSE file in the project root for full license information.
//

#include <nanoHAL.h>
#include "win_dev_serial_native_target.h"
#include <Esp32_DeviceMapping.h>

// UART buffer size: 256 bytes
#define UART_BUFER_SIZE  256

// in UWP the COM ports are named COM1, COM2, COM3. But ESP32 uses internally UART0, UART1, UART2. This maps the port index 1, 2 or 3 to the uart number 0, 1 or 2
#define PORT_INDEX_TO_UART_NUM(portIndex)	((portIndex) - 1)
// in UWP the COM ports are named COM1, COM2, COM3. But ESP32 uses internally UART0, UART1, UART2. This maps the uart number 0, 1 or 2 to the port index 1, 2 or 3
#define UART_NUM_TO_PORT_INDEX(uart_num)	((uart_num) + 1)

static const char* TAG = "SerialDevice";

static NF_PAL_UART Uart0_PAL;
static NF_PAL_UART Uart1_PAL;
static NF_PAL_UART Uart2_PAL;

void UnitializePalUart(NF_PAL_UART* palUart)
{
    if(palUart->SerialDevice)
    {
        // send the exit signal to the UART event handling queue
        xQueueSend(palUart->UartEventQueue, (void*)UART_EVENT_MAX, (portTickType)0);

        // free buffers meory
        platform_free(palUart->RxBuffer);
        platform_free(palUart->TxBuffer);
        
        // null all pointers
        palUart->RxBuffer = NULL;
        palUart->TxBuffer = NULL;
        palUart->SerialDevice = NULL;

        // delete driver
        uart_driver_delete((uart_port_t)palUart->UartNum);

        // delete task, if any
        if(palUart->UartEventTask)
        {
            vTaskDelete(palUart->UartEventTask);
        }

        palUart->UartEventTask = NULL;

        Esp32_SetMappedDevicePins( DEV_TYPE_SERIAL, palUart->UartNum, Esp32SerialPin_Tx, UART_PIN_NO_CHANGE);
        Esp32_SetMappedDevicePins( DEV_TYPE_SERIAL, palUart->UartNum, Esp32SerialPin_Rx, UART_PIN_NO_CHANGE);
        Esp32_SetMappedDevicePins( DEV_TYPE_SERIAL, palUart->UartNum, Esp32SerialPin_Rts, UART_PIN_NO_CHANGE);
        Esp32_SetMappedDevicePins( DEV_TYPE_SERIAL, palUart->UartNum, Esp32SerialPin_Cts, UART_PIN_NO_CHANGE);
    }
}

void Esp32_Serial_UnitializeAll()
{
    for (int uart_num = 0; uart_num < UART_NUM_MAX; uart_num++) 
    {
        // free buffers memory
        switch (uart_num)
        {
            case UART_NUM_0:
                UnitializePalUart(&Uart0_PAL);
                break;

            case UART_NUM_1:
                UnitializePalUart(&Uart1_PAL);
                break;

            case UART_NUM_2:
                UnitializePalUart(&Uart2_PAL);
                break;

            // can't even happen
            default:
                break;
        }
    }
}

void uart_event_task(void *pvParameters)
{
    // get PAL UART from task parameters
    NF_PAL_UART* palUart = (NF_PAL_UART*)pvParameters;

    uart_event_t event;
    bool run = true;
    bool readData;
    int32_t watchCharPos;
    int32_t readCount;
    size_t bufferedSize;
    uint8_t* buffer;

    ESP_LOGI( TAG, "Start UART event task");

	while(run)
	{
        ESP_LOGI( TAG, "Waiting UART EVT");

        // Waiting for UART event.
        if( xQueueReceive(
                palUart->UartEventQueue,
                &event, 
                (portTickType)portMAX_DELAY))
        {
            ESP_LOGI( TAG, "UART EVT %d", event.type);

            // reset vars
            readData = false;
            watchCharPos = -1;

            // deal with event type
            switch(event.type)
            {
                case UART_DATA:
                    // set flag
                    readData = true;
                    break;
                
                case UART_PATTERN_DET:
                    // Pattern detection used for the WatchChar
                    watchCharPos = uart_pattern_get_pos(palUart->UartNum);

                    // set flag
                    readData = true;
                    break;

                case UART_FIFO_OVF:
                case UART_BUFFER_FULL:
                    uart_flush_input(palUart->UartNum);
                    xQueueReset(palUart->UartEventQueue);
                    break;

                case UART_EVENT_MAX:
                    // signal to end the task (UART_EVENT_MAX used)
                    run = false;
                    break;

                default:
                    break;
            }

            if(readData)
            {
                // get how many chars are buffered on RX FIFO
                uart_get_buffered_data_len(palUart->UartNum, &bufferedSize);

                if(bufferedSize > 0)
                {
                    // alloc buffer to read RX FIFO
                    buffer = (uint8_t*)platform_malloc(bufferedSize);

                    // sanity check
                    if(buffer)
                    {
                        // try to read RX FIFO
                        readCount = uart_read_bytes(palUart->UartNum, buffer, bufferedSize, 1);

                        // push to UART RX buffer
                        palUart->RxRingBuffer.Push(buffer, readCount);

                        // free buffer
                        platform_free(buffer);

                        // is there a read operation going on?
                        if(palUart->RxBytesToRead > 0)
                        {
                            // yes
                            // check if the requested bytes are available in the buffer...
                            //... or if the watch char was received
                            if( (palUart->RxRingBuffer.Length() >= palUart->RxBytesToRead) ||
                                (watchCharPos > -1))
                            {
                                // reset Rx bytes to read count
                                palUart->RxBytesToRead = 0;

                                // fire event for Rx buffer complete
                                Events_Set(SYSTEM_EVENT_FLAG_COM_IN);
                            }
                        }
                        else
                        {
                            // no read operation ongoing, so fire an event
                        
