nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
                            // post a managed event with the port index and event code (check if there is a watch char in the buffer or just any char)
                            //  check if callbacks are registered so this is called only if there is anyone listening otherwise don't bother
                            if( palUart->SerialDevice[ Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::FIELD___callbacksDataReceivedEvent ].Dereference() != NULL )
                            {
                                PostManagedEvent( 
                                    EVENT_SERIAL, 
                                    0, 
                                    UART_NUM_TO_PORT_INDEX(palUart->UartNum), 
                                    (watchCharPos > -1) ? SerialData_WatchChar : SerialData_Chars );
                            }
                        }
                    }
                }
            }
        }
    }

    vTaskDelete(NULL);
}

void UartTxWorkerTask(void *pvParameters)
{
    // get PAL UART from task parameters
    NF_PAL_UART* palUart = (NF_PAL_UART*)pvParameters;

    // Write data directly to UART FIFO
    // by design: don't bother checking the return value
    uart_write_bytes( palUart->UartNum, (const char*)palUart->TxRingBuffer.Reader(), palUart->TxOngoingCount);

    // pop elements from ring buffer, just pop
    palUart->TxRingBuffer.Pop(palUart->TxOngoingCount);

    // set event flag for COM OUT
    Events_Set( SYSTEM_EVENT_FLAG_COM_OUT );

    // delete task
    vTaskDelete(NULL);
}

// estimate the time required to perform the TX transaction
bool IsLongRunningOperation(uint32_t bufferSize, uint32_t baudRate, uint32_t& estimatedDurationMiliseconds)
{
    // simplifying calculation assuming worst case values for stop bits
    estimatedDurationMiliseconds = ((8 + 2) * bufferSize * 1000) / baudRate;

    if(estimatedDurationMiliseconds > CLR_RT_Thread::c_TimeQuantum_Milliseconds)
    {
        // total operation time will exceed thread quantum, so this is a long running operation
        return true;
    }
    else
    {
        return false;        
    }
}

HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeDispose___VOID( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();

    uart_port_t uart_num;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
    
    switch (uart_num)
    {
        case UART_NUM_0:
            UnitializePalUart(&Uart0_PAL);
            break;

        case UART_NUM_1:
            UnitializePalUart(&Uart1_PAL);
            break;

        case UART_NUM_2:
            UnitializePalUart(&Uart2_PAL);
            break;

        // can't even happen
        default:
            break;
    }

    NANOCLR_NOCLEANUP();
}

//
//  Initialise a new Serial port
//
HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeInit___VOID( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();

    char task_name[16];
    uart_port_t uart_num;
    esp_err_t esp_err;

    NF_PAL_UART* palUart;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
    if ( uart_num > UART_NUM_2 || uart_num < 0 )
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // call the configure and abort if not OK
    NANOCLR_CHECK_HRESULT( NativeConfig___VOID(stack) );

    switch(uart_num)
    {
        case UART_NUM_0:
            // set UART PAL
            palUart = &Uart0_PAL;
            break;

        case UART_NUM_1:
            // set UART PAL
            palUart = &Uart1_PAL;
            break;

        case UART_NUM_2:
            // set UART PAL
            palUart = &Uart2_PAL;
            break;

        default:
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // alloc buffers memory
    palUart->TxBuffer = (uint8_t*)platform_malloc(UART_BUFER_SIZE);
    palUart->RxBuffer = (uint8_t*)platform_malloc(UART_BUFER_SIZE);

    // sanity check
    if( palUart->TxBuffer == NULL ||
        palUart->RxBuffer == NULL)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OUT_OF_MEMORY);
    }

    // init buffers
    palUart->TxRingBuffer.Initialize( palUart->TxBuffer, UART_BUFER_SIZE );
    palUart->RxRingBuffer.Initialize( palUart->RxBuffer, UART_BUFER_SIZE );

    // set/reset all the rest
    palUart->SerialDevice = stack.This();
    palUart->UartNum = uart_num;
    palUart->TxOngoingCount = 0; 
    palUart->RxBytesToRead = 0; 

    // Install driver
    esp_err = uart_driver_install(  uart_num, 
                                    UART_BUFER_SIZE, 			    // rx_buffer_size, 
                                    0, 			                    // tx_buffer_size, not buffered
                                    20,                  			// queue_size
                                    &(palUart->UartEventQueue),     // QueueHandle_t *uart_queue ( none for now )
                                    0                               // intr_alloc_flags
                                    );
    if ( esp_err != ESP_OK )
    {
        ESP_LOGE( TAG, "Failed to install uart driver");
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // Create a task to handle UART event from ISR
    sprintf(task_name, "uart%d_events", uart_num);
    if( xTaskCreatePinnedToCore(
            uart_event_task,
            task_name,
            2048,
            palUart,
            12,
            &(palUart->UartEventTask),
            1
        ) != pdPASS )
    {
        ESP_LOGE( TAG, "Failed to start UART events task");
        NANOCLR_SET_AND_LEAVE(CLR_E_FAIL); 
    }

