nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
    // Ensure driver gets unitialized during soft reboot
    HAL_AddSoftRebootHandler(Esp32_Serial_UnitializeAll);

    NANOCLR_NOCLEANUP(); 
}

//
//  Set up serial port Configuration
//
HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeConfig___VOID( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();
    {
		uart_config_t uart_config;
    
        // get a pointer to the managed object instance and check that it's not NULL
        CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

        // Get Uart number for serial device
        uart_port_t uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
        if ( uart_num > UART_NUM_2 || uart_num < 0)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }

        // setup configuration
        // baud rate
        uart_config.baud_rate  = (uint32_t)pThis[ FIELD___baudRate ].NumericByRef().s4;

        // data bits
        switch( (uint16_t)pThis[ FIELD___dataBits ].NumericByRef().s4 )
        {
            case 5:
                uart_config.data_bits = UART_DATA_5_BITS;
                break;

            case 6:
                uart_config.data_bits = UART_DATA_6_BITS; 
                break;

            case 7:
                uart_config.data_bits = UART_DATA_7_BITS;
                break;

            case 8:
                uart_config.data_bits = UART_DATA_8_BITS;
                break;

            default:
                NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }
 
        // parity 
        switch ((SerialParity)pThis[ FIELD___parity ].NumericByRef().s4)
        {
            default:
            case SerialParity_None :
                uart_config.parity = UART_PARITY_DISABLE;                       
                break;

            case SerialParity_Even :
                uart_config.parity = UART_PARITY_EVEN;                       
                break;

            case SerialParity_Odd :
                uart_config.parity = UART_PARITY_ODD;                       
                break;
        }
 
        // stop bits 
        switch ((SerialStopBitCount)pThis[ FIELD___stopBits ].NumericByRef().s4)
        {
            default:
            case SerialStopBitCount_One :
                uart_config.stop_bits = UART_STOP_BITS_1;                       
                break;

            case SerialStopBitCount_OnePointFive :
                uart_config.stop_bits = UART_STOP_BITS_1_5;
                break;

            case SerialStopBitCount_Two :
                uart_config.stop_bits = UART_STOP_BITS_2;
                break;
        }

        uart_config.rx_flow_ctrl_thresh = 120;

        bool EnableXonXoff = false;
        switch ((SerialHandshake)pThis[ FIELD___handshake ].NumericByRef().s4)
        {
           default:
            case SerialHandshake_None :
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;                    
                break;

           case SerialHandshake_RequestToSend :
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_RTS ;                      
				uart_config.rx_flow_ctrl_thresh = 122;
				break;
            
            case SerialHandshake_RequestToSendXOnXOff :
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_RTS ;     
                uart_config.rx_flow_ctrl_thresh = 122;
                EnableXonXoff = true;
                break;

            case SerialHandshake_XOnXOff :
                EnableXonXoff = true;                 
                break;
        }

        if( uart_param_config(uart_num, &uart_config) != ESP_OK )
        {
           ESP_LOGE( TAG, "Failed to set UART parameters configuration");
           NANOCLR_SET_AND_LEAVE(CLR_E_FAIL); 
        }

        if ( EnableXonXoff )
        {
           uart_set_sw_flow_ctrl(uart_num, true, 20, 40);
        }

        // Map to currently assigned pins
        int txPin  = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Tx); 
        int rxPin  = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Rx);
        int rtsPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Rts);
        int ctsPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Cts);

        // check if TX, RX pins have been previously set
        if( txPin == UART_PIN_NO_CHANGE ||
            rxPin == UART_PIN_NO_CHANGE)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_PIN_UNAVAILABLE);
        }

        // Don't use RTS/CTS if no hardware handshake enabled
        if ( uart_config.flow_ctrl == UART_HW_FLOWCTRL_DISABLE )
        {
            rtsPin = UART_PIN_NO_CHANGE;
            ctsPin = UART_PIN_NO_CHANGE;
        }

        if( uart_set_pin(uart_num, txPin, rxPin, rtsPin, ctsPin) != ESP_OK ) 
        {
            ESP_LOGE( TAG, "Failed to set UART pins");
            NANOCLR_SET_AND_LEAVE(CLR_E_FAIL); 
        }    

        // null pointers and vars
        pThis = NULL;
    }
    NANOCLR_NOCLEANUP();
}

//
//  Write data into buffer
//
HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeWrite___VOID__SZARRAY_U1( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();
    {
        NF_PAL_UART* palUart = NULL;

        uint8_t* data;
        size_t length = 0;

        // get a pointer to the managed object instance and check that it's not NULL
        CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

        if(pThis[ FIELD___disposed ].NumericByRef().u1 != 0)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
        }

        // dereference the data buffer from the argument
        CLR_RT_HeapBlock_Array* dataBuffer = stack.Arg1().DereferenceArray();

        // get a the pointer to the array by using the first element of the array
        data = dataBuffer->GetFirstElement();

        // get the size of the buffer
        length = (size_t)dataBuffer->m_numOfElements;

