nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
        // Get Uart number for serial device
        uart_port_t uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
 
        // get pointer to PAL UART 
        switch (uart_num)
        {
            case UART_NUM_0:
                palUart = &Uart0_PAL;
                break;

            case UART_NUM_1:
                palUart = &Uart1_PAL;
                break;

            case UART_NUM_2:
                palUart = &Uart2_PAL;
                break;

            // can't even happen
            default:
                break;
        }

        // check if there is enough room in the buffer
        if(palUart->TxRingBuffer.Capacity() - palUart->TxRingBuffer.Length() < length)
        {
            // not enough room in the buffer
             NANOCLR_SET_AND_LEAVE(CLR_E_BUFFER_TOO_SMALL);
        }

        // push data to buffer
        size_t bytesWritten = palUart->TxRingBuffer.Push(data, length);

        // check if all requested bytes were written
        if(bytesWritten != length)
        {
            // not sure if this is the best exception to throw here...
            NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
        }
        
        // need to update the _unstoredBufferLength field in the SerialDeviceOutputStream
        // get pointer to outputStream field
        CLR_RT_HeapBlock* outputStream = pThis[ FIELD___outputStream ].Dereference();
        // get pointer to _unstoredBufferLength field and udpate field value
        outputStream[Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDeviceOutputStream::FIELD___unstoredBufferLength].NumericByRef().s4 = palUart->TxRingBuffer.Length();

        // null pointers and vars
        pThis = NULL;
    }
    NANOCLR_NOCLEANUP();
}

//
// Store - Send buffer and wait
//
HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeStore___U4( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();

    NF_PAL_UART* palUart = NULL;

    bool isLongRunningOperation = false;
    uint32_t estimatedDurationMiliseconds;
    size_t length = 0;
    uart_port_t uart_num;

    int64_t*  timeoutTicks;
    bool eventResult = true;
    bool txOk = false;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

    if(pThis[ FIELD___disposed ].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);

    // get pointer to PAL UART 
    switch (uart_num)
    {
        case UART_NUM_0:
            palUart = &Uart0_PAL;
            break;

        case UART_NUM_1:
            palUart = &Uart1_PAL;
            break;

        case UART_NUM_2:
            palUart = &Uart2_PAL;
            break;

        // can't even happen
        default:
            break;
    }

    // check if this is a long running operation
    isLongRunningOperation = IsLongRunningOperation(
        palUart->TxRingBuffer.Length(), 
        (uint32_t)pThis[ FIELD___baudRate ].NumericByRef().s4, 
        (uint32_t&)estimatedDurationMiliseconds);

    // check if there is anything the buffer
    if(palUart->TxRingBuffer.Length() > 0)
    {
        // check if there is a TX operation ongoing
        if(palUart->TxOngoingCount == 0)
        {
            // OK to Tx
            txOk = true;
        }
        else
        {
            // need to wait for the ongoing operation to complete before starting a new one
        }
    }

    if(txOk)
    {
        // optimize buffer for sequential reading
        palUart->TxRingBuffer.OptimizeSequence();

        // get data length available in the buffer
        length = palUart->TxRingBuffer.Length();

        if(isLongRunningOperation)
        {
            // setup timeout
            NANOCLR_CHECK_HRESULT( stack.SetupTimeoutFromTimeSpan(pThis[ FIELD___writeTimeout ], timeoutTicks ) );

            // this is a long running operation and hasn't started yet
            // perform operation by launching a thread to
            if(stack.m_customState == 1)
            {
                // push to the stack how many bytes bytes where buffered for Tx
                stack.PushValueI4(length);

                // set TX count
                palUart->TxOngoingCount = length;

                // Create a task to handle UART event from ISR
                char task_name[16];
                sprintf(task_name, "uart%d_tx", uart_num);
                
                if( xTaskCreate(
                        UartTxWorkerTask,
                        task_name,
                        2048,
                        palUart,
                        12,
                        NULL) != pdPASS )
                {
                    ESP_LOGE( TAG, "Failed to start UART TX task");
                    NANOCLR_SET_AND_LEAVE(CLR_E_FAIL); 
                }

                // bump custom state so the read value above is pushed only once
                stack.m_customState = 2;
            }
        }
        else
        {
            // this is NOT a long running operation
            // perform TX operation right away

            // Write data to ring buffer to start sending
            // by design: don't bother checking the return value
            uart_write_bytes( uart_num, (const char*)palUart->TxRingBuffer.Reader(), length);
            
            // pop data that was written to FIFO
            // pop elements from ring buffer, just pop
            palUart->TxRingBuffer.Pop(length);
        }
    }

    while(eventResult)
    {
        if(!isLongRunningOperation)
        {
            // this is not a long running operation so nothing to do here
            break;
        }

        // non-blocking wait allowing other threads to run while we wait for the Tx operation to complete
        NANOCLR_CHECK_HRESULT(g_CLR_RT_ExecutionEngine.WaitEvents( stack.m_owningThread, *timeoutTicks, CLR_RT_ExecutionEngine::c_Event_SerialPortOut, eventResult ));

