nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
        if(eventResult)
        {
            // event occurred
            // get from the eval stack how many bytes were buffered to Tx
            length = stack.m_evalStack[1].NumericByRef().s4;

            // reset Tx ongoing count
            palUart->TxOngoingCount = 0;

            // done here
            break;
        }
        else
        {
            NANOCLR_SET_AND_LEAVE( CLR_E_TIMEOUT );
        }
    }

    if(isLongRunningOperation)
    {
        // pop length heap block from stack
        stack.PopValue();

        // pop timeout heap block from stack
        stack.PopValue();
    }

    stack.SetResult_U4(length);

    // null pointers and vars
    pThis = NULL;

    NANOCLR_NOCLEANUP();
}

HRESULT IRAM_ATTR Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeRead___U4__SZARRAY_U1__I4__I4( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();

    CLR_RT_HeapBlock_Array* dataBuffer;
    NF_PAL_UART* palUart = NULL;

    uint8_t* data;
    size_t dataLength = 0;

    size_t count = 0;
    size_t bytesRead = 0;
    size_t bytesToRead = 0;

    InputStreamOptions options = InputStreamOptions_None;
    uart_port_t uart_num;

    int64_t*  timeoutTicks;
    bool eventResult = true;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

    if(pThis[ FIELD___disposed ].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }

    // dereference the data buffer from the argument
    dataBuffer = stack.Arg1().DereferenceArray();

    // get a the pointer to the array by using the first element of the array
    data = dataBuffer->GetFirstElement();

    // get the length of the data buffer
    dataLength =  dataBuffer->m_numOfElements;

    // get how many bytes are requested to read
    count = stack.Arg2().NumericByRef().s4;

    // get the InputStreamOptions option
    options = (InputStreamOptions)stack.Arg3().NumericByRef().s4;

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
    
    // get pointer to PAL UART 
    switch (uart_num)
    {
        case UART_NUM_0:
            palUart = &Uart0_PAL;
            break;

        case UART_NUM_1:
            palUart = &Uart1_PAL;
            break;

        case UART_NUM_2:
            palUart = &Uart2_PAL;
            break;

        // can't even happen
        default:
            break;
    }

    // setup timeout from the _readtimeout heap block
    NANOCLR_CHECK_HRESULT(stack.SetupTimeoutFromTimeSpan( pThis[ FIELD___readTimeout ], timeoutTicks ));

    // figure out what's available in the Rx ring buffer
    if(palUart->RxRingBuffer.Length() >= count)
    {
        // read from Rx ring buffer
        bytesToRead = count;

        // is the read ahead option enabled?
        if(options == InputStreamOptions_ReadAhead)
        {
            // yes
            // check how many bytes we can store in the buffer argument
            if(dataLength < palUart->RxRingBuffer.Length())
            {
                // read as many bytes has the buffer can hold
                bytesToRead = dataLength;
            }
            else
            {
                // read everything that's available in the ring buffer
                bytesToRead = palUart->RxRingBuffer.Length();
            }
        }

        // we have enough bytes, skip wait for event
        eventResult = false;
               
        // clear event by getting it
        Events_Get(SYSTEM_EVENT_FLAG_COM_IN);
    }
    else
    {
        if(stack.m_customState == 1)
        {
            // not enough bytes available, have to read from UART
            palUart->RxBytesToRead = count;
            
            // clear event by getting it
            Events_Get(SYSTEM_EVENT_FLAG_COM_IN);

            // don't read anything from the buffer yet
            bytesToRead = 0;
        }  
    }

    while(eventResult)
    {
        if(stack.m_customState == 1)
        {
            if(bytesToRead > 0)
            {
                // enough bytes available
                eventResult = false;
            }
            else
            {
                // need to read from the UART
                // update custom state
                stack.m_customState = 2;
            }
        }
        else
        {
            // wait for event
            NANOCLR_CHECK_HRESULT(g_CLR_RT_ExecutionEngine.WaitEvents(stack.m_owningThread, *timeoutTicks, CLR_RT_ExecutionEngine::c_Event_SerialPortIn, eventResult));

            if(!eventResult)
            {
                // event timeout

                // compute how many bytes to read 
                // considering the InputStreamOptions read ahead option
                if(options == InputStreamOptions_ReadAhead)
                {
                    // yes
                    // check how many bytes we can store in the buffer argument
                    if(dataLength < palUart->RxRingBuffer.Length())
                    {
                        // read as many bytes has the buffer can hold
                        bytesToRead = dataLength;
                    }
                    else
                    {
                        // read everything that's available in the ring buffer
                        bytesToRead = palUart->RxRingBuffer.Length();
                    }
                }
                else
                {
                    // take InputStreamOptions_Partial as default and read requested quantity or what's available
                    bytesToRead = count;

                    if(count > palUart->RxRingBuffer.Length())
                    {
                        // need to adjust because there aren't enough bytes available
                        bytesToRead = palUart->RxRingBuffer.Length();
                    }
                }
            }
        }
    }

    if(bytesToRead > 0)
    {
        // pop the requested bytes from the ring buffer
        bytesRead = palUart->RxRingBuffer.Pop(data, bytesToRead);
    }

    // pop timeout heap block from stack
    stack.PopValue();

