nanoframework/nf-interpreter/targets/FreeRTOS_ESP32/ESP32_WROOM_32/nanoCLR/Windows.Devices.SerialCommunication/win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice.cpp
    // return how many bytes were read
    stack.SetResult_U4(bytesRead);

    NANOCLR_NOCLEANUP();
}

HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::NativeSetWatchChar___VOID( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();

    uart_port_t uart_num;
    uint8_t watchChar;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

    if(pThis[ FIELD___disposed ].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }
    
    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
    
    // Get the watch char
    watchChar = (uint8_t)pThis[ FIELD___watchChar ].NumericByRef().u1;
    
    // Enable pattern detection for the serial device
    uart_enable_pattern_det_intr(uart_num, watchChar, 1, 10000, 10, 10);
    //Reset the pattern queue length to record at most 10 pattern positions.
    uart_pattern_queue_reset(uart_num, 10);

    NANOCLR_NOCLEANUP();
}

HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::get_BytesToRead___U4( CLR_RT_StackFrame& stack )
{
    NANOCLR_HEADER();

    NF_PAL_UART* palUart = NULL;
    uart_port_t uart_num;

    // get a pointer to the managed object instance and check that it's not NULL
    CLR_RT_HeapBlock* pThis = stack.This();  FAULT_ON_NULL(pThis);

    if(pThis[ FIELD___disposed ].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }
    
    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[ FIELD___portIndex ].NumericByRef().s4);
    
    // get pointer to PAL UART 
    switch (uart_num)
    {
        case UART_NUM_0:
            palUart = &Uart0_PAL;
            break;

        case UART_NUM_1:
            palUart = &Uart1_PAL;
            break;

        case UART_NUM_2:
            palUart = &Uart2_PAL;
            break;

        // can't even happen
        default:
            break;
    }

    // return how many bytes can be read from the Rx buffer
    stack.SetResult_U4(palUart->RxRingBuffer.Length());

	NANOCLR_NOCLEANUP();
}

HRESULT Library_win_dev_serial_native_Windows_Devices_SerialCommunication_SerialDevice::GetDeviceSelector___STATIC__STRING( CLR_RT_StackFrame& stack )
{
   NANOCLR_HEADER();
   {
       // declare the device selector string whose max size is "COM1,COM2,COM3" + terminator 
       // COM1 is being used for VS debug, so it's not available
       char deviceSelectorString[ 15 ] = "COM2,COM3";

       // because the caller is expecting a result to be returned
       // we need set a return result in the stack argument using the appropriate SetResult according to the variable type (a string here)
       stack.SetResult_String(deviceSelectorString);
   }
   NANOCLR_NOCLEANUP_NOLABEL();
}
